[
{
    "id": "1294905",
    "url": "https://dl.acm.org/citation.cfm?id=1294905&preflayout=flat",
    "title": "Resource Discovery with Evolving Tuples",
    "doi": "10.1145/1294904.1294905",
    "year": "2007",
    "authors": [
        {
            "name": "Drew Stovall",
            "url": "https://dl.acm.org/author_page.cfm?id=81338491272&coll=DL&dl=ACM&trk=0"
        },
        {
            "name": "Christine Julien",
            "url": "https://dl.acm.org/author_page.cfm?id=81328488860&coll=DL&dl=ACM&trk=0"
        }
    ],
    "abstract": "Pervasive computing environments present new challenges that hinder traditional approaches to software engineering. In this paper, we tackle one such challenge: the need of pervasive application developers to have access to constructs that enable resource discovery in dynamic environments. We first define the evolving tuples model, a novel extension to traditional tuple spaces that allows applications to embed context-aware adaptation directly in structures traditionally used for distributed coordination. The behavior applications embed in evolving tuples can subsequently be used by discovery queries to allow environmental characteristics to directly impact the results of discovery. Our approach minimizes the amount of infrastructure that must be available to support discovery by embedding the discovery functionality almost exclusively within the tuple and makes the resource discovery process transparent. At the same time, our model retains many of the benefits of traditional tuple space approaches, namely providing content-based coordination that is easy for developers to understand and implement. The evolving tuple's inherent flexibility also allows resource discovery to adapt to the changing resources, applications, and environments.",
    "venue": {
        "name": "FSE",
        "url": "https://dl.acm.org/event.cfm?id=RE201"
    },
    "cited_by": [
        "1789106",
        "1572180",
        "1810169",
        "2480619",
        "2504982"
    ]
},
{
    "id": "1294906",
    "url": "https://dl.acm.org/citation.cfm?id=1294906&preflayout=flat",
    "title": "Self-healing BPEL Processes with Dynamo and the JBoss Rule Engine",
    "doi": "10.1145/1294904.1294906",
    "year": "2007",
    "authors": [
        {
            "name": "Luciano Baresi",
            "url": "https://dl.acm.org/author_page.cfm?id=81100467886&coll=DL&dl=ACM&trk=0"
        },
        {
            "name": "Sam Guinea",
            "url": "https://dl.acm.org/author_page.cfm?id=81100198696&coll=DL&dl=ACM&trk=0"
        },
        {
            "name": "Liliana Pasquale",
            "url": "https://dl.acm.org/author_page.cfm?id=81338490570&coll=DL&dl=ACM&trk=0"
        }
    ],
    "abstract": "Many emerging domains such as ambient intelligence, context-aware applications, and pervasive computing are embracing the assumption that their software applications will be deployed in an open-world. By adopting the Service Oriented Architecture paradigm, and in particular its Web service based implementation, they are capable of leveraging components that are remote and not under their jurisdication, i.e. services. However, the distributed nature of these systems, the presence of many stakeholders, and the fact that no one has a complete knowledge of the system preclude classic static verification techniques. The capability to \"self-heal\" has become paramount. In this paper we present our solution to self-healing BPEL compositions called Dynamo. It is an assertion-based solution, that provides special purpose languages (WSCoL and WSReL) for defining monitoring and recovery activities. These are executed using Dynamo, which consists of an AOP-extended version of the ActiveBPEL orchestration engine, and which leverages the JBoss Rule Engine to ensure self-healing capabilities. The approach is exemplified on a complex case study.",
    "venue": {
        "name": "FSE",
        "url": "https://dl.acm.org/event.cfm?id=RE201"
    },
    "cited_by": [
        "1496656",
        "2941030",
        "1947763",
        "1484735",
        "1504917",
        "1370927",
        "1926668",
        "1893725",
        "1555092",
        "1882327",
        "1884237",
        "2467400",
        "2363155",
        "2603318",
        "1367607",
        "2245373",
        "1696094",
        "1985673",
        "3077893",
        "1985672",
        "1504906",
        "1893603",
        "2576193",
        "2739045",
        "2595136",
        "1985676",
        "2512690",
        "2831270",
        "2825459",
        "2128576",
        "1937325",
        "3031279",
        "2554614"
    ]
},
{
    "id": "1294907",
    "url": "https://dl.acm.org/citation.cfm?id=1294907&preflayout=flat",
    "title": "A Component Model for Dynamic Adaptive Systems",
    "doi": "10.1145/1294904.1294907",
    "year": "2007",
    "authors": [
        {
            "name": "Holger Klus",
            "url": "https://dl.acm.org/author_page.cfm?id=81314490350&coll=DL&dl=ACM&trk=0"
        },
        {
            "name": "Dirk Niebuhr",
            "url": "https://dl.acm.org/author_page.cfm?id=81100487366&coll=DL&dl=ACM&trk=0"
        },
        {
            "name": "Andreas Rausch",
            "url": "https://dl.acm.org/author_page.cfm?id=81100228154&coll=DL&dl=ACM&trk=0"
        }
    ],
    "abstract": "Dynamic adaptive systems are systems which change their behavior according to the needs of the user during runtime based on context information. Since it is not feasible to develop these systems from scratch every time, a component model enabling dynamic adaptive systems is necessary. Moreover, an infrastructure is required which is capable of wiring dynamic adaptive systems from a set of components in order to provide a dynamic and adaptive behavior to the user. In this paper we present such kind of infrastructure called DAiSI (Dynamic Adaptive System Infrastructure) and the underlying component model. We will present an example scenario illustrating the adaptation capabilities of the introduced component model.",
    "venue": {
        "name": "FSE",
        "url": "https://dl.acm.org/event.cfm?id=RE201"
    },
    "cited_by": [
        "2022322",
        "1566970",
        "2434209",
        "1985604",
        "2952331"
    ]
},
{
    "id": "1294908",
    "url": "https://dl.acm.org/citation.cfm?id=1294908&preflayout=flat",
    "title": "A Reuse-based Approach to the Correct and Automatic Composition of Web-services",
    "doi": "10.1145/1294904.1294908",
    "year": "2007",
    "authors": [
        {
            "name": "Paola Inverardi",
            "url": "https://dl.acm.org/author_page.cfm?id=81100388058&coll=DL&dl=ACM&trk=0"
        },
        {
            "name": "Massimo Tivoli",
            "url": "https://dl.acm.org/author_page.cfm?id=81325490462&coll=DL&dl=ACM&trk=0"
        }
    ],
    "abstract": "Service oriented technologies, such as web services, can be considered one of the latest trends in distributed computing. Nowadays, the Internet arena is populated by an ever more increasing number of web services. This has led to the need for reuse-based approaches to the automatic construction of new services as a correct composition of existing ones. A composition of services is correct when it respects the Service Level Specification (SLS) specified for the composite service to be built. To this end, we propose an extension of our previous work on the automatic component assembly. The aim of this extension is to propose an automatic and specification-based approach for constructing composite services from existing ones, which are discovered from a service repository. We instantiate the proposal in the context of web services. This work has to be considered as an ongoing work. In this paper, we also raise some research questions concerning the current gap between what we are able to do by means of the proposed extension and what still remains an open issue.",
    "venue": {
        "name": "FSE",
        "url": "https://dl.acm.org/event.cfm?id=RE201"
    },
    "cited_by": [
        "1985823",
        "3071965",
        "1431513",
        "2337481",
        "2430543"
    ]
},
{
    "id": "1294958",
    "url": "https://dl.acm.org/citation.cfm?id=1294958&preflayout=flat",
    "title": "Divide and Conquer: Scalability and Variability for Adaptive Middleware",
    "doi": "10.1145/1294948.1294958",
    "year": "2007",
    "authors": [
        {
            "name": "Ulrich Scholz",
            "url": "https://dl.acm.org/author_page.cfm?id=81338490914&coll=DL&dl=ACM&trk=0"
        },
        {
            "name": "Romain Rouvoy",
            "url": "https://dl.acm.org/author_page.cfm?id=81100341097&coll=DL&dl=ACM&trk=0"
        }
    ],
    "abstract": "In this paper, we introduce a divide and conquer approach for the adaptation of distributed applications management by a potentially large number of interacting middleware instances. The method aims at a quick partitioning of the overall problem into smaller sub-problems that can be solved almost independently. The partitioning is found by symbolic reasoning and by applying expert knowledge that is encoded in explicit rules.",
    "venue": {
        "name": "FSE",
        "url": "https://dl.acm.org/event.cfm?id=RE201"
    },
    "cited_by": []
},
{
    "id": "1294910",
    "url": "https://dl.acm.org/citation.cfm?id=1294910&preflayout=flat",
    "title": "Mobility Management in B3G Networks: A Middleware-based Approach",
    "doi": "10.1145/1294904.1294910",
    "year": "2007",
    "authors": [
        {
            "name": "Letian Rong",
            "url": "https://dl.acm.org/author_page.cfm?id=81310490403&coll=DL&dl=ACM&trk=0"
        },
        {
            "name": "Manel Fredj",
            "url": "https://dl.acm.org/author_page.cfm?id=81338488503&coll=DL&dl=ACM&trk=0"
        },
        {
            "name": "Valérie Issarny",
            "url": "https://dl.acm.org/author_page.cfm?id=81100251972&coll=DL&dl=ACM&trk=0"
        },
        {
            "name": "Nikolaos Georgantas",
            "url": "https://dl.acm.org/author_page.cfm?id=81100574582&coll=DL&dl=ACM&trk=0"
        }
    ],
    "abstract": "The B3G (Beyond 3G) networking will enable mobile users to roam freely through heterogeneous networks on an all-IP platform. However, mobility handling in such an environment poses new challenges. Traditionally, mobility protocols such as Mobile IP, SIP and SCTP are used to manage mobility in B3G, but they require telecommunication companies to either modify existing network infrastructures or deploy central entities in the network core to handle mobility. This is not feasible in a fully distributed computing environment (e.g., P2P) and mobile ad hoc networks that are part of B3G networking. As an alternative, this paper introduces a middleware component with modularized functionalities to facilitate mobility management in a fully distributed B3G environment.",
    "venue": {
        "name": "FSE",
        "url": "https://dl.acm.org/event.cfm?id=RE201"
    },
    "cited_by": []
},
{
    "id": "1294911",
    "url": "https://dl.acm.org/citation.cfm?id=1294911&preflayout=flat",
    "title": "Software Deployment Architecture and Quality-of-service in Pervasive Environments",
    "doi": "10.1145/1294904.1294911",
    "year": "2007",
    "authors": [
        {
            "name": "Nenad Medvidovic",
            "url": "https://dl.acm.org/author_page.cfm?id=81100011427&coll=DL&dl=ACM&trk=0"
        },
        {
            "name": "Sam Malek",
            "url": "https://dl.acm.org/author_page.cfm?id=81100267865&coll=DL&dl=ACM&trk=0"
        }
    ],
    "abstract": "Over the past several years we have investigated two problems related to the domain of highly distributed, mobile, resource constrained, embedded, and pervasive environments: software deployment and quality of service (QoS). We have done so with the explicit focus on the role played by software architecture in deployment, and on its relationship to QoS. In the process, we have amassed a body of knowledge and experience, and assembled a suite of solutions for targeting different facets of the interplay among software architecture, deployment, and QoS. At the same time, the area we are addressing has proven to be multi-faceted and very complex, constantly presenting new challenges. In this paper we outline the contours of the problem of QoS in architecture-based deployment, our strategy for addressing it, and the challenges that remain. We view this as an important (and fruitful) area of research.",
    "venue": {
        "name": "FSE",
        "url": "https://dl.acm.org/event.cfm?id=RE201"
    },
    "cited_by": [
        "2001682",
        "2577519",
        "1988039",
        "2667030",
        "2381608",
        "2463560",
        "1955147",
        "2000232",
        "2330438",
        "2748828"
    ]
},
{
    "id": "1294912",
    "url": "https://dl.acm.org/citation.cfm?id=1294912&preflayout=flat",
    "title": "Using Proximity Relations for the Adaptation of Mobile Field Services",
    "doi": "10.1145/1294904.1294912",
    "year": "2007",
    "authors": [
        {
            "name": "Heinz-Josef Eikerling",
            "url": "https://dl.acm.org/author_page.cfm?id=81100045520&coll=DL&dl=ACM&trk=0"
        },
        {
            "name": "Matthias Benesch",
            "url": "https://dl.acm.org/author_page.cfm?id=81338487436&coll=DL&dl=ACM&trk=0"
        },
        {
            "name": "Frank Berger",
            "url": "https://dl.acm.org/author_page.cfm?id=81100228618&coll=DL&dl=ACM&trk=0"
        }
    ],
    "abstract": "We describe the use of proximity relations for enhancing a service platform regarding the support of context-aware mobile business-to-business and business-to-employee processes. Such relations constitute a special type of spatio-temporal context which is assumed to be produced by a configurable set of different sensing systems. We propose a networked service (context engine) to which the context data is delivered for further processing and for making the data accessible to other services and applications of the software platform through various interaction modes. As will be seen, a mobile business processes can be optimized in various ways (e.g., acceleration or reduction of occurrences of errors during the process execution) through this. The service-oriented wrapping results in the key advantage that the underlying context-sensing (i.e., tracking) technology can be easily exchanged without affecting the rest of the system or -- even worse -- the process. As an application of the concepts, we describe a setup in which the proximity of an assembly (or a respective part of it) to be maintained and the mobile worker doing the maintenance is used to configure the services in the service platform.",
    "venue": {
        "name": "FSE",
        "url": "https://dl.acm.org/event.cfm?id=RE201"
    },
    "cited_by": []
},
{
    "id": "1294913",
    "url": "https://dl.acm.org/citation.cfm?id=1294913&preflayout=flat",
    "title": "A Basis for Performance Property Prediction of Ubiquitous Self-adapting Systems",
    "doi": "10.1145/1294904.1294913",
    "year": "2007",
    "authors": [
        {
            "name": "Gunnar Brataas",
            "url": "https://dl.acm.org/author_page.cfm?id=81100173526&coll=DL&dl=ACM&trk=0"
        },
        {
            "name": "Jacqueline Floch",
            "url": "https://dl.acm.org/author_page.cfm?id=81100426783&coll=DL&dl=ACM&trk=0"
        },
        {
            "name": "Romain Rouvoy",
            "url": "https://dl.acm.org/author_page.cfm?id=81100341097&coll=DL&dl=ACM&trk=0"
        },
        {
            "name": "Pyrros Bratskas",
            "url": "https://dl.acm.org/author_page.cfm?id=81338487684&coll=DL&dl=ACM&trk=0"
        },
        {
            "name": "George A. Papadopoulos",
            "url": "https://dl.acm.org/author_page.cfm?id=81100543697&coll=DL&dl=ACM&trk=0"
        }
    ],
    "abstract": "Utility-based adaptation approaches permit to determine the \"best\" suited variant of an application at run-time. Utility policies are usually specified in terms of resources and QoS dimensions. Although utility policies provide a precise formulation for adaptation decision, they are difficult to specify. The developer especially needs assistance in the specification of performance properties. In this paper, we investigate using a performance engineering framework, for the specification of such properties and identify several open research issues.",
    "venue": {
        "name": "FSE",
        "url": "https://dl.acm.org/event.cfm?id=RE201"
    },
    "cited_by": []
},
{
    "id": "1294914",
    "url": "https://dl.acm.org/citation.cfm?id=1294914&preflayout=flat",
    "title": "Scaling Up SLA Monitoring in Pervasive Environments",
    "doi": "10.1145/1294904.1294914",
    "year": "2007",
    "authors": [
        {
            "name": "Antonia Bertolino",
            "url": "https://dl.acm.org/author_page.cfm?id=81100192955&coll=DL&dl=ACM&trk=0"
        },
        {
            "name": "Guglielmo De Angelis",
            "url": "https://dl.acm.org/author_page.cfm?id=81317493012&coll=DL&dl=ACM&trk=0"
        },
        {
            "name": "Antonino Sabetta",
            "url": "https://dl.acm.org/author_page.cfm?id=81100152276&coll=DL&dl=ACM&trk=0"
        },
        {
            "name": "Sebastian Elbaum",
            "url": "https://dl.acm.org/author_page.cfm?id=81100007035&coll=DL&dl=ACM&trk=0"
        }
    ],
    "abstract": "Service level agreements (SLA) are contracts defining the obligations and rights between the provider of a web service and a client with respect to the service's quality. An essential component of SLA management is the run-time checking of relevant quality parameters. SLA checking must be precise and continuous to timely detect any possible SLA violations. Available techniques and mechanisms to check SLAs, however, are unlikely to scale to more complex families of SLAs tailored to fit diverse and very large groups of clients whose devices have limited storage and bandwidth capabilities. This challenge results not only in the commitment of valuable resources to SLA checking (reducing the service provider capacity), but it can also trigger additional violations and cause disagreements between client and server due to perceived violations. In this paper we focus on the elaboration of this challenge and on identifying opportunities that arise from the inherent diversity present in scenarios rendering web services in pervasive environments.",
    "venue": {
        "name": "FSE",
        "url": "https://dl.acm.org/event.cfm?id=RE201"
    },
    "cited_by": [
        "1858270",
        "2401746",
        "2806842",
        "1642984",
        "1978598",
        "1689005"
    ]
},
{
    "id": "1294915",
    "url": "https://dl.acm.org/citation.cfm?id=1294915&preflayout=flat",
    "title": "Towards Model Driven Design of Service-based Context-aware Applications",
    "doi": "10.1145/1294904.1294915",
    "year": "2007",
    "authors": [
        {
            "name": "Vincenzo Grassi",
            "url": "https://dl.acm.org/author_page.cfm?id=81100173252&coll=DL&dl=ACM&trk=0"
        },
        {
            "name": "Andrea Sindico",
            "url": "https://dl.acm.org/author_page.cfm?id=81338491196&coll=DL&dl=ACM&trk=0"
        }
    ],
    "abstract": "Context-aware adaptation is an important feature for pervasive computing applications. In our approach, we intend to support the viewpoint of context-aware adaptation as a crosscutting concern with respect to the core \"business logic\" of an application. In this way, the design of the application core can be decoupled from the design of the adaptation logic. This facilitate the plugging of different adaptation strategies within the same basic application, tailoring it for different contexts. To this end, we leverage ideas from the domains of model-driven development and aspect-oriented design. We assume that the applications to be adapted are designed according to the service-oriented paradigm. Hence, our adaptation mechanisms only assume the knowledge of information accessible in this kind of applications.",
    "venue": {
        "name": "FSE",
        "url": "https://dl.acm.org/event.cfm?id=RE201"
    },
    "cited_by": [
        "1806468",
        "1408621",
        "1562119",
        "1537924",
        "2762728",
        "1551327",
        "1537924",
        "2426152",
        "2576027",
        "1618993",
        "2388873",
        "2406215"
    ]
},
{
    "id": "1294916",
    "url": "https://dl.acm.org/citation.cfm?id=1294916&preflayout=flat",
    "title": "Engineering Mobile Field Worker Applications",
    "doi": "10.1145/1294904.1294916",
    "year": "2007",
    "authors": [
        {
            "name": "Pietro Mazzoleni",
            "url": "https://dl.acm.org/author_page.cfm?id=81100223605&coll=DL&dl=ACM&trk=0"
        },
        {
            "name": "Stefan Tai",
            "url": "https://dl.acm.org/author_page.cfm?id=81100311531&coll=DL&dl=ACM&trk=0"
        }
    ],
    "abstract": "We envision next-generation Field Workers to use interactive Web applications deployed on sophisticated mobile devices in order to access remote services and data in support of their business processes. Engineering such applications requires combining services computing with mobile computing and end-user oriented Web application development. In this position paper, we identify the main challenges in this context, and propose a preliminary platform architecture for application deployment on Field Worker devices that addresses some of these challenges.",
    "venue": {
        "name": "FSE",
        "url": "https://dl.acm.org/event.cfm?id=RE201"
    },
    "cited_by": [
        "2779518",
        "2406215"
    ]
}
]