[
{
    "id": "3121245",
    "url": "https://dl.acm.org/citation.cfm?id=3121245&preflayout=flat",
    "title": "A-TEST 2017: Proceedings of the 8th ACM SIGSOFT International Workshop on Automated Software Testing",
    "doi": null,
    "year": "2017",
    "authors": [
        {
            "name": "Tanja Vos",
            "url": "https://dl.acm.org/author_page.cfm?id=81100095172&coll=DL&dl=ACM&trk=0"
        },
        {
            "name": "Sigrid Eldh",
            "url": "https://dl.acm.org/author_page.cfm?id=81317493250&coll=DL&dl=ACM&trk=0"
        },
        {
            "name": "Wishnu Prasetya",
            "url": "https://dl.acm.org/author_page.cfm?id=81385600565&coll=DL&dl=ACM&trk=0"
        }
    ],
    "abstract": "An abstract is not available.",
    "venue": {
        "name": "FSE",
        "url": "https://dl.acm.org/event.cfm?id=RE201"
    },
    "cited_by": []
}
,{
    "id": "2994291",
    "url": "https://dl.acm.org/citation.cfm?id=2994291&preflayout=flat",
    "title": "A-TEST 2016: Proceedings of the 7th International Workshop on Automating Test Case Design, Selection, and Evaluation",
    "doi": null,
    "year": "2016",
    "authors": [
        {
            "name": "Tanja Vos",
            "url": "https://dl.acm.org/author_page.cfm?id=81100095172&coll=DL&dl=ACM&trk=0"
        },
        {
            "name": "Sigrid Eldh",
            "url": "https://dl.acm.org/author_page.cfm?id=81317493250&coll=DL&dl=ACM&trk=0"
        },
        {
            "name": "Wishnu Prasetya",
            "url": "https://dl.acm.org/author_page.cfm?id=81385600565&coll=DL&dl=ACM&trk=0"
        }
    ],
    "abstract": "An abstract is not available.",
    "venue": {
        "name": "FSE",
        "url": "https://dl.acm.org/event.cfm?id=RE201"
    },
    "cited_by": []
}
,{
    "id": "2804322",
    "url": "https://dl.acm.org/citation.cfm?id=2804322&preflayout=flat",
    "title": "A-TEST 2015: Proceedings of the 6th International Workshop on Automating Test Case Design, Selection and Evaluation",
    "doi": null,
    "year": "2015",
    "authors": [
        {
            "name": "Tanja Vos",
            "url": "https://dl.acm.org/author_page.cfm?id=81100095172&coll=DL&dl=ACM&trk=0"
        },
        {
            "name": "Sigrid Eldh",
            "url": "https://dl.acm.org/author_page.cfm?id=81317493250&coll=DL&dl=ACM&trk=0"
        },
        {
            "name": "Wishnu Prasetya",
            "url": "https://dl.acm.org/author_page.cfm?id=81385600565&coll=DL&dl=ACM&trk=0"
        }
    ],
    "abstract": "An abstract is not available.",
    "venue": {
        "name": "FSE",
        "url": "https://dl.acm.org/event.cfm?id=RE201"
    },
    "cited_by": []
}
,{
    "id": "2024436",
    "url": "https://dl.acm.org/citation.cfm?id=2024436&preflayout=flat",
    "title": "ASAS '11: Proceedings of the 8th Workshop on Assurances for Self-adaptive Systems",
    "doi": null,
    "year": "2011",
    "authors": [
        {
            "name": "Javier Cámara",
            "url": "https://dl.acm.org/author_page.cfm?id=81332492029&coll=DL&dl=ACM&trk=0"
        },
        {
            "name": "Rogßrio de Lemos",
            "url": "https://dl.acm.org/author_page.cfm?id=81448599819&coll=DL&dl=ACM&trk=0"
        },
        {
            "name": "Carlo Ghezzi",
            "url": "https://dl.acm.org/author_page.cfm?id=81100230292&coll=DL&dl=ACM&trk=0"
        },
        {
            "name": "Antónia Lopes",
            "url": "https://dl.acm.org/author_page.cfm?id=81100368235&coll=DL&dl=ACM&trk=0"
        }
    ],
    "abstract": "Until recently, repairing faults, or performing upgrades on different kinds of software systems have been tasks performed as a maintenance activity conducted by human operators. However, as software systems become central to support everyday activities and face increasing levels of complexity, as well as of uncertainty in their operational environments, there is a critical need to improve their dependability, optimize their performance, and at the same time, reduce their development and operational costs. This situation has led to the development of systems able to reconfigure their structure and modify their behaviour at run-time in order to improve their operation, recover from failures, and adapt to environmental changes, with little or no human intervention. These kinds of systems typically operate using an explicit representation of their own structure and goals, and appear in the literature under different designations (e.g. self-adaptive, self-healing, self-managed, autonomic, etc.). In spite of recent and important advances in the area, one key aspect of self-adaptive systems that poses important challenges that remain to be tackled in depth is assurances, that is, providing evidence that systems satisfy their set of stated functional and non-functional properties during operation. Specifically, assurances involve not only system dependability and security, but also resilience with respect to attributes such as availability, reliability, safety, or performance. Developing high-assurance, self-adaptive systems is difficult, since these systems tend to be highly context-dependent, and this fact introduces a high degree of uncertainty that has to be dealt with (e.g., resource variability). ASAS will bring together researchers to discuss software engineering aspects, including the methods, architectures, languages, algorithms, techniques, and tools that can be used to support assurances in development and deployment of self-adaptive software systems. In particular, ASAS is intended as a complement to the efforts started while ago at the successful FSE workshop series on Self-Healing Systems (WOSS), which has culminated with the organization of the ICSE workshop series on Software Engineering for Adaptive and Self-Managing Systems (SEAMS), which now is a symposium. In contrast with those events, ASAS intends to focus on the collection of evidence, its storage and analysis for the provision of assurances that a self-adaptive software system is able to behave functionally and nonfunctionally according to its specification.",
    "venue": {
        "name": "FSE",
        "url": "https://dl.acm.org/event.cfm?id=RE201"
    },
    "cited_by": []
}
,{
    "id": "1595768",
    "url": "https://dl.acm.org/citation.cfm?id=1595768&preflayout=flat",
    "title": "CASTA '09: Proceedings of the First International Workshop on Context-aware Software Technology and Applications",
    "doi": null,
    "year": "2009",
    "authors": [
        {
            "name": "Oscar Nierstrasz",
            "url": "https://dl.acm.org/author_page.cfm?id=81100134506&coll=DL&dl=ACM&trk=0"
        }
    ],
    "abstract": "CASTA 2009 is the first international workshop on Context-Aware Software Technology and Applications. Context-awareness is an emerging theme in a large number of application domains, and supporting mechanisms in areas such as programming languages and middleware have appeared in recent years. Nevertheless, the diverse communities working on context-awareness have largely worked independently. This workshop is a first attempt to bring these communities together to compare experiences and discuss directions for future research. The call for contributions attracted submissions in a wide range of different domains, ranging from components and architectures to support context-awareness, through context-aware programming languages, to approaches for modeling context for web services, business processes, and access authorization. The workshop presentation format is modeled after an approach pioneered by WCRE (the Working Conference on Reverse Engineering). Instead of authors presenting their own paper, each paper in a session is presented by an author of a different paper. A short yes/no question period may follow. After all papers have been presented, a general discussion on the session theme is opened. This format has proven to be very stimulating for workshops, since it raises open questions and differences in perspective rather than focusing on established results. For a workshop on context-awareness, it offers an ideal way to highlight differences in context arising from the different participating communities. In addition to paper presentations and open discussions, the workshop includes an invited talk by Hajo Reijers entitled \"Some Context Dimensions for Business Processes,\" and a demonstration session devoted to tools and applications.",
    "venue": {
        "name": "FSE",
        "url": "https://dl.acm.org/event.cfm?id=RE201"
    },
    "cited_by": []
}
,]
